Merge pull request #32 from alnovis/feature/v1.6.0
Feature/v1.6.0
